qmk/qmk_firmware/keyboards/nuphy/halo96v2/ansi/mcu_stm32f0xx.h
/*
Copyright 2023 NuPhy & Persama (@Persama)

This program is free software: you can redistribute it and/or modify
it under the terms of the GNU General Public License as published by
the Free Software Foundation, either version 2 of the License, or
(at your option) any later version.

This program is distributed in the hope that it will be useful,
but WITHOUT ANY WARRANTY; without even the implied warranty of
MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
GNU General Public License for more details.

You should have received a copy of the GNU General Public License
along with this program.  If not, see <http://www.gnu.org/licenses/>.
*/
#pragma once

#include "hal.h"
#include "stm32f0xx.h"
// ================================================================================
// ================================================================================

typedef enum { ST_RESET = 0, ST_SET = !ST_RESET } ST_FlagStatus, ST_ITStatus;

//////////////////////////////////////////////////////////////////////////////
// PWR

/** @defgroup PWR_PVD_detection_level
 * @{
 */

#define PWR_PVDLevel_0 PWR_CR_PLS_LEV0
#define PWR_PVDLevel_1 PWR_CR_PLS_LEV1
#define PWR_PVDLevel_2 PWR_CR_PLS_LEV2
#define PWR_PVDLevel_3 PWR_CR_PLS_LEV3
#define PWR_PVDLevel_4 PWR_CR_PLS_LEV4
#define PWR_PVDLevel_5 PWR_CR_PLS_LEV5
#define PWR_PVDLevel_6 PWR_CR_PLS_LEV6
#define PWR_PVDLevel_7 PWR_CR_PLS_LEV7

#define IS_PWR_PVD_LEVEL(LEVEL) (((LEVEL) == PWR_PVDLevel_0) || ((LEVEL) == PWR_PVDLevel_1) || ((LEVEL) == PWR_PVDLevel_2) || ((LEVEL) == PWR_PVDLevel_3) || ((LEVEL) == PWR_PVDLevel_4) || ((LEVEL) == PWR_PVDLevel_5) || ((LEVEL) == PWR_PVDLevel_6) || ((LEVEL) == PWR_PVDLevel_7))
/**
 * @}
 */

/** @defgroup PWR_WakeUp_Pins
 * @{
 */

#define PWR_WakeUpPin_1 PWR_CSR_EWUP1
#define PWR_WakeUpPin_2 PWR_CSR_EWUP2
#define IS_PWR_WAKEUP_PIN(PIN) (((PIN) == PWR_WakeUpPin_1) || ((PIN) == PWR_WakeUpPin_2))
/**
 * @}
 */

/** @defgroup PWR_Regulator_state_is_Sleep_STOP_mode
 * @{
 */

#define PWR_Regulator_ON ((uint32_t)0x00000000)
#define PWR_Regulator_LowPower ((uint32_t)0x00000001)
#define IS_PWR_REGULATOR(REGULATOR) (((REGULATOR) == PWR_Regulator_ON) || ((REGULATOR) == PWR_Regulator_LowPower))
/**
 * @}
 */

/** @defgroup PWR_SLEEP_mode_entry
 * @{
 */

#define PWR_SLEEPEntry_WFI ((uint8_t)0x01)
#define PWR_SLEEPEntry_WFE ((uint8_t)0x02)
#define IS_PWR_SLEEP_ENTRY(ENTRY) (((ENTRY) == PWR_SLEEPEntry_WFI) || ((ENTRY) == PWR_SLEEPEntry_WFE))

/**
 * @}
 */

/** @defgroup PWR_STOP_mode_entry
 * @{
 */

#define PWR_STOPEntry_WFI ((uint8_t)0x01)
#define PWR_STOPEntry_WFE ((uint8_t)0x02)
#define IS_PWR_STOP_ENTRY(ENTRY) (((ENTRY) == PWR_STOPEntry_WFI) || ((ENTRY) == PWR_STOPEntry_WFE))

/**
 * @}
 */

/** @defgroup PWR_Flag
 * @{
 */

#define PWR_FLAG_WU PWR_CSR_WUF
#define PWR_FLAG_SB PWR_CSR_SBF
#define PWR_FLAG_PVDO PWR_CSR_PVDO
#define PWR_FLAG_VREFINTRDY PWR_CSR_VREFINTRDYF

#define IS_PWR_GET_FLAG(FLAG) (((FLAG) == PWR_FLAG_WU) || ((FLAG) == PWR_FLAG_SB) || ((FLAG) == PWR_FLAG_PVDO) || ((FLAG) == PWR_FLAG_VREFINTRDY))

#define IS_PWR_CLEAR_FLAG(FLAG) (((FLAG) == PWR_FLAG_WU) || ((FLAG) == PWR_FLAG_SB))
/**
 * @}
 */

/**
 * @}
 */

/* Exported macro ------------------------------------------------------------*/
/* Exported functions ------------------------------------------------------- */

/* Function used to set the PWR configuration to the default reset state ******/
void PWR_DeInit(void);

/* Backup Domain Access function **********************************************/
void PWR_BackupAccessCmd(FunctionalState NewState);

/* PVD configuration functions ************************************************/
void PWR_PVDLevelConfig(uint32_t PWR_PVDLevel);
void PWR_PVDCmd(FunctionalState NewState);

/* WakeUp pins configuration functions ****************************************/
void PWR_WakeUpPinCmd(uint32_t PWR_WakeUpPin, FunctionalState NewState);

/* Low Power modes configuration functions ************************************/
void PWR_EnterSleepMode(uint8_t PWR_SLEEPEntry);
void PWR_EnterSTOPMode(uint32_t PWR_Regulator, uint8_t PWR_STOPEntry);
void PWR_EnterSTANDBYMode(void);

/* Flags management functions *************************************************/
FlagStatus PWR_GetFlagStatus(uint32_t PWR_FLAG);
void       PWR_ClearFlag(uint32_t PWR_FLAG);

//////////////////////////////////////////////////////////////////////////////
// EXTI
/**
 * @brief  EXTI mode enumeration
 */

typedef enum { EXTI_Mode_Interrupt = 0x00, EXTI_Mode_Event = 0x04 } EXTIMode_TypeDef;

#define IS_EXTI_MODE(MODE) (((MODE) == EXTI_Mode_Interrupt) || ((MODE) == EXTI_Mode_Event))

/**
 * @brief  EXTI Trigger enumeration
 */

typedef enum { EXTI_Trigger_Rising = 0x08, EXTI_Trigger_Falling = 0x0C, EXTI_Trigger_Rising_Falling = 0x10 } EXTITrigger_TypeDef;

#define IS_EXTI_TRIGGER(TRIGGER) (((TRIGGER) == EXTI_Trigger_Rising) || ((TRIGGER) == EXTI_Trigger_Falling) || ((TRIGGER) == EXTI_Trigger_Rising_Falling))
/**
 * @brief  EXTI Init Structure definition
 */

typedef struct {
    uint32_t EXTI_Line; /*!< Specifies the EXTI lines to be enabled or disabled.
                             This parameter can be any combination of @ref EXTI_Lines */

    EXTIMode_TypeDef EXTI_Mode; /*!< Specifies the mode for the EXTI lines.
                                     This parameter can be a value of @ref EXTIMode_TypeDef */

    EXTITrigger_TypeDef EXTI_Trigger; /*!< Specifies the trigger signal active edge for the EXTI lines.
                                           This parameter can be a value of @ref EXTIMode_TypeDef */

    FunctionalState EXTI_LineCmd; /*!< Specifies the new state of the selected EXTI lines.
                                       This parameter can be set either to ENABLE or DISABLE */
} EXTI_InitTypeDef;

/* Exported constants --------------------------------------------------------*/

/** @defgroup EXTI_Exported_Constants
 * @{
 */
/** @defgroup EXTI_Lines
 * @{
 */

#define EXTI_Line0 ((uint32_t)0x00000001)  /*!< External interrupt line 0  */
#define EXTI_Line1 ((uint32_t)0x00000002)  /*!< External interrupt line 1  */
#define EXTI_Line2 ((uint32_t)0x00000004)  /*!< External interrupt line 2  */
#define EXTI_Line3 ((uint32_t)0x00000008)  /*!< External interrupt line 3  */
#define EXTI_Line4 ((uint32_t)0x00000010)  /*!< External interrupt line 4  */
#define EXTI_Line5 ((uint32_t)0x00000020)  /*!< External interrupt line 5  */
#define EXTI_Line6 ((uint32_t)0x00000040)  /*!< External interrupt line 6  */
#define EXTI_Line7 ((uint32_t)0x00000080)  /*!< External interrupt line 7  */
#define EXTI_Line8 ((uint32_t)0x00000100)  /*!< External interrupt line 8  */
#define EXTI_Line9 ((uint32_t)0x00000200)  /*!< External interrupt line 9  */
#define EXTI_Line10 ((uint32_t)0x00000400) /*!< External interrupt line 10 */
#define EXTI_Line11 ((uint32_t)0x00000800) /*!< External interrupt line 11 */
#define EXTI_Line12 ((uint32_t)0x00001000) /*!< External interrupt line 12 */
#define EXTI_Line13 ((uint32_t)0x00002000) /*!< External interrupt line 13 */
#define EXTI_Line14 ((uint32_t)0x00004000) /*!< External interrupt line 14 */
#define EXTI_Line15 ((uint32_t)0x00008000) /*!< External interrupt line 15 */
#define EXTI_Line16                                        \
    ((uint32_t)0x00010000) /*!< External interrupt line 16 \
                                Connected to the PVD Output */
#define EXTI_Line17                                        \
    ((uint32_t)0x00020000) /*!< Internal interrupt line 17 \
                                Connected to the RTC Alarm \
                                event */
#define EXTI_Line19                                         \
    ((uint32_t)0x00080000) /*!< Internal interrupt line 19  \
                                Connected to the RTC Tamper \
                                and Time Stamp events */
#define EXTI_Line21                                           \
    ((uint32_t)0x00200000) /*!< Internal interrupt line 21    \
                                Connected to the Comparator 1 \
                                event */
#define EXTI_Line22                                           \
    ((uint32_t)0x00400000) /*!< Internal interrupt line 22    \
                                Connected to the Comparator 2 \
                                event */
#define EXTI_Line23                                          \
    ((uint32_t)0x00800000) /*!< Internal interrupt line 23   \
                                Connected to the I2C1 wakeup \
                                event */
#define EXTI_Line25                                            \
    ((uint32_t)0x02000000) /*!< Internal interrupt line 25     \
                                Connected to the USART1 wakeup \
                                event */
#define EXTI_Line27                                         \
    ((uint32_t)0x08000000) /*!< Internal interrupt line 27  \
                                Connected to the CEC wakeup \
                                event */

#define IS_EXTI_LINE(LINE) ((((LINE) & (uint32_t)0xF5140000) == 0x00) && ((LINE) != (uint16_t)0x00))

