qmk/qmk_firmware/keyboards/nuphy/halo96v2/ansi/mcu_stm32f0xx.h
#define IS_GET_EXTI_LINE(LINE) (((LINE) == EXTI_Line0) || ((LINE) == EXTI_Line1) || ((LINE) == EXTI_Line2) || ((LINE) == EXTI_Line3) || ((LINE) == EXTI_Line4) || ((LINE) == EXTI_Line5) || ((LINE) == EXTI_Line6) || ((LINE) == EXTI_Line7) || ((LINE) == EXTI_Line8) || ((LINE) == EXTI_Line9) || ((LINE) == EXTI_Line10) || ((LINE) == EXTI_Line11) || ((LINE) == EXTI_Line12) || ((LINE) == EXTI_Line13) || ((LINE) == EXTI_Line14) || ((LINE) == EXTI_Line15) || ((LINE) == EXTI_Line16) || ((LINE) == EXTI_Line17) || ((LINE) == EXTI_Line19) || ((LINE) == EXTI_Line21) || ((LINE) == EXTI_Line22))

/**
 * @}
 */

/**
 * @}
 */

/* Exported macro ------------------------------------------------------------*/
/* Exported functions ------------------------------------------------------- */
/* Function used to set the EXTI configuration to the default reset state *****/
void EXTI_DeInit(void);

/* Initialization and Configuration functions *********************************/
void EXTI_Init(EXTI_InitTypeDef* EXTI_InitStruct);
void EXTI_StructInit(EXTI_InitTypeDef* EXTI_InitStruct);
void EXTI_GenerateSWInterrupt(uint32_t EXTI_Line);

/* Interrupts and flags management functions **********************************/
FlagStatus EXTI_GetFlagStatus(uint32_t EXTI_Line);
void       EXTI_ClearFlag(uint32_t EXTI_Line);
ITStatus   EXTI_GetITStatus(uint32_t EXTI_Line);
void       EXTI_ClearITPendingBit(uint32_t EXTI_Line);

//////////////////////////////////////////////////////////////////////////////
// RCC
static __I uint8_t APBAHBPrescTable[16] = {0, 0, 0, 0, 1, 2, 3, 4, 1, 2, 3, 4, 6, 7, 8, 9};

#define RCC_AHBPeriph_GPIOA RCC_AHBENR_GPIOAEN
#define RCC_AHBPeriph_GPIOB RCC_AHBENR_GPIOBEN
#define RCC_AHBPeriph_GPIOC RCC_AHBENR_GPIOCEN
#define RCC_AHBPeriph_GPIOD RCC_AHBENR_GPIODEN
#define RCC_AHBPeriph_GPIOF RCC_AHBENR_GPIOFEN
#define RCC_AHBPeriph_TS RCC_AHBENR_TSEN
#define RCC_AHBPeriph_CRC RCC_AHBENR_CRCEN
#define RCC_AHBPeriph_FLITF RCC_AHBENR_FLITFEN
#define RCC_AHBPeriph_SRAM RCC_AHBENR_SRAMEN
#define RCC_AHBPeriph_DMA1 RCC_AHBENR_DMA1EN

#define RCC_APB2Periph_SYSCFG RCC_APB2ENR_SYSCFGEN
#define RCC_APB2Periph_ADC1 RCC_APB2ENR_ADC1EN
#define RCC_APB2Periph_TIM1 RCC_APB2ENR_TIM1EN
#define RCC_APB2Periph_SPI1 RCC_APB2ENR_SPI1EN
#define RCC_APB2Periph_USART1 RCC_APB2ENR_USART1EN
#define RCC_APB2Periph_TIM15 RCC_APB2ENR_TIM15EN
#define RCC_APB2Periph_TIM16 RCC_APB2ENR_TIM16EN
#define RCC_APB2Periph_TIM17 RCC_APB2ENR_TIM17EN
#define RCC_APB2Periph_DBGMCU RCC_APB2ENR_DBGMCUEN

#define RCC_APB1Periph_TIM2 RCC_APB1ENR_TIM2EN
#define RCC_APB1Periph_TIM3 RCC_APB1ENR_TIM3EN
#define RCC_APB1Periph_TIM6 RCC_APB1ENR_TIM6EN
#define RCC_APB1Periph_TIM14 RCC_APB1ENR_TIM14EN
#define RCC_APB1Periph_WWDG RCC_APB1ENR_WWDGEN
#define RCC_APB1Periph_SPI2 RCC_APB1ENR_SPI2EN
#define RCC_APB1Periph_USART2 RCC_APB1ENR_USART2EN
#define RCC_APB1Periph_I2C1 RCC_APB1ENR_I2C1EN
#define RCC_APB1Periph_I2C2 RCC_APB1ENR_I2C2EN
#define RCC_APB1Periph_PWR RCC_APB1ENR_PWREN
#define RCC_APB1Periph_DAC RCC_APB1ENR_DACEN
#define RCC_APB1Periph_CEC RCC_APB1ENR_CECEN

#define HSI_VALUE ((uint32_t)8000000)
#define HSE_VALUE ((uint32_t)8000000)
#define LSE_VALUE ((uint32_t)32768)

#define RCC_CFGR_PLLMULL ((uint32_t)0x003C0000) /*!< PLLMUL[3:0] bits (PLL multiplication factor) */
// #define  RCC_CFGR_PLLSRC                     ((uint32_t)0x00010000)        /*!< PLL entry clock source */

/*******************  Bit definition for RCC_CFGR2 register  ******************/
/*!< PREDIV1 configuration */
#define RCC_CFGR2_PREDIV1 ((uint32_t)0x0000000F)   /*!< PREDIV1[3:0] bits */
#define RCC_CFGR2_PREDIV1_0 ((uint32_t)0x00000001) /*!< Bit 0 */
#define RCC_CFGR2_PREDIV1_1 ((uint32_t)0x00000002) /*!< Bit 1 */
#define RCC_CFGR2_PREDIV1_2 ((uint32_t)0x00000004) /*!< Bit 2 */
#define RCC_CFGR2_PREDIV1_3 ((uint32_t)0x00000008) /*!< Bit 3 */

/*******************  Bit definition for RCC_CFGR3 register  ******************/
/*!< USART1 Clock source selection */
// #define  RCC_CFGR3_USART1SW                  ((uint32_t)0x00000003)        /*!< USART1SW[1:0] bits */
// #define  RCC_CFGR3_USART1SW_0                ((uint32_t)0x00000001)        /*!< Bit 0 */
// #define  RCC_CFGR3_USART1SW_1                ((uint32_t)0x00000002)        /*!< Bit 1 */
/*!< I2C1 Clock source selection */
// #define  RCC_CFGR3_I2C1SW                    ((uint32_t)0x00000010)        /*!< I2C1SW bits */
// #define  RCC_CFGR3_CECSW                     ((uint32_t)0x00000040)        /*!< CECSW bits */
#define RCC_CFGR3_ADCSW ((uint32_t)0x00000100) /*!< ADCSW bits */

#define HSI14_VALUE                                                                      \
    ((uint32_t)14000000) /*!< Value of the Internal High Speed oscillator for ADC in Hz. \
                             The real value may vary depending on the variations         \
                             in voltage and temperature.  */

typedef struct {
    uint32_t SYSCLK_Frequency;
    uint32_t HCLK_Frequency;
    uint32_t PCLK_Frequency;
    uint32_t ADCCLK_Frequency;
    uint32_t CECCLK_Frequency;
    uint32_t I2C1CLK_Frequency;
    uint32_t USART1CLK_Frequency;
} RCC_ClocksTypeDef;

/**
 * @brief  Forces or releases AHB peripheral reset.
 * @param  RCC_AHBPeriph: specifies the AHB peripheral to reset.
 *         This parameter can be any combination of the following values:
 *             @arg RCC_AHBPeriph_GPIOA:         GPIOA clock
 *             @arg RCC_AHBPeriph_GPIOB:         GPIOB clock
 *             @arg RCC_AHBPeriph_GPIOC:         GPIOC clock
 *             @arg RCC_AHBPeriph_GPIOD:         GPIOD clock
 *             @arg RCC_AHBPeriph_GPIOF:         GPIOF clock
 *             @arg RCC_AHBPeriph_TS:            TS clock
 * @param  NewState: new state of the specified peripheral reset.
 *         This parameter can be: ENABLE or DISABLE.
 * @retval None
 */
void RCC_AHBPeriphResetCmd(uint32_t RCC_AHBPeriph, FunctionalState NewState) {
    if (NewState != DISABLE) {
        RCC->AHBRSTR |= RCC_AHBPeriph;
    } else {
        RCC->AHBRSTR &= ~RCC_AHBPeriph;
    }
}

/**
 * @brief  Forces or releases High Speed APB (APB2) peripheral reset.
 * @param  RCC_APB2Periph: specifies the APB2 peripheral to reset.
 *         This parameter can be any combination of the following values:
 *             @arg RCC_APB2Periph_SYSCFG:      SYSCFG clock
 *             @arg RCC_APB2Periph_ADC1:        ADC1 clock
 *             @arg RCC_APB2Periph_TIM1:        TIM1 clock
 *             @arg RCC_APB2Periph_SPI1:        SPI1 clock
 *             @arg RCC_APB2Periph_USART1:      USART1 clock
 *             @arg RCC_APB2Periph_TIM15:       TIM15 clock
 *             @arg RCC_APB2Periph_TIM16:       TIM16 clock
 *             @arg RCC_APB2Periph_TIM17:       TIM17 clock
 *             @arg RCC_APB2Periph_DBGMCU:      DBGMCU clock
 * @param  NewState: new state of the specified peripheral reset.
 *         This parameter can be: ENABLE or DISABLE.
 * @retval None
 */
void RCC_APB2PeriphResetCmd(uint32_t RCC_APB2Periph, FunctionalState NewState) {
    if (NewState != DISABLE) {
        RCC->APB2RSTR |= RCC_APB2Periph;
    } else {
        RCC->APB2RSTR &= ~RCC_APB2Periph;
    }
}

/**
 * @brief  Forces or releases Low Speed APB (APB1) peripheral reset.
 * @param  RCC_APB1Periph: specifies the APB1 peripheral to reset.
 *         This parameter can be any combination of the following values:
 *           @arg RCC_APB1Periph_TIM2:      TIM2 clock
 *           @arg RCC_APB1Periph_TIM3:      TIM3 clock
 *           @arg RCC_APB1Periph_TIM6:      TIM6 clock
 *           @arg RCC_APB1Periph_TIM14:     TIM14 clock
 *           @arg RCC_APB1Periph_WWDG:      WWDG clock
 *           @arg RCC_APB1Periph_SPI2:      SPI2 clock
 *           @arg RCC_APB1Periph_USART2:    USART2 clock
 *           @arg RCC_APB1Periph_I2C1:      I2C1 clock
 *           @arg RCC_APB1Periph_I2C2:      I2C2 clock
 *           @arg RCC_APB1Periph_PWR:       PWR clock
 *           @arg RCC_APB1Periph_DAC:       DAC clock
 *           @arg RCC_APB1Periph_CEC:       CEC clock
 * @param  NewState: new state of the specified peripheral clock.
 *         This parameter can be: ENABLE or DISABLE.
 * @retval None
 */
void RCC_APB1PeriphResetCmd(uint32_t RCC_APB1Periph, FunctionalState NewState) {
    if (NewState != DISABLE) {
        RCC->APB1RSTR |= RCC_APB1Periph;
    } else {
        RCC->APB1RSTR &= ~RCC_APB1Periph;
    }
}

/**
 * @brief  Enables or disables the AHB peripheral clock.
 * @note   After reset, the peripheral clock (used for registers read/write access)
 *         is disabled and the application software has to enable this clock before
 *         using it.
 * @param  RCC_AHBPeriph: specifies the AHB peripheral to gates its clock.
 *         This parameter can be any combination of the following values:
 *             @arg RCC_AHBPeriph_GPIOA:         GPIOA clock
 *             @arg RCC_AHBPeriph_GPIOB:         GPIOB clock
 *             @arg RCC_AHBPeriph_GPIOC:         GPIOC clock
 *             @arg RCC_AHBPeriph_GPIOD:         GPIOD clock
 *             @arg RCC_AHBPeriph_GPIOF:         GPIOF clock
 *             @arg RCC_AHBPeriph_TS:            TS clock
 *             @arg RCC_AHBPeriph_CRC:           CRC clock
 *             @arg RCC_AHBPeriph_FLITF: (has effect only when the Flash memory is in power down mode)
 *             @arg RCC_AHBPeriph_SRAM:          SRAM clock
 *             @arg RCC_AHBPeriph_DMA1:          DMA1 clock
 * @param  NewState: new state of the specified peripheral clock.
 *         This parameter can be: ENABLE or DISABLE.
 * @retval None
 */
void RCC_AHBPeriphClockCmd(uint32_t RCC_AHBPeriph, FunctionalState NewState) {
    if (NewState != DISABLE) {
        RCC->AHBENR |= RCC_AHBPeriph;
    } else {
        RCC->AHBENR &= ~RCC_AHBPeriph;
    }
}

