qmk/qmk_firmware/keyboards/nuphy/halo96v2/ansi/mcu_stm32f0xx.h
void RCC_APB2PeriphClockCmd(uint32_t RCC_APB2Periph, FunctionalState NewState) {
    if (NewState != DISABLE) {
        RCC->APB2ENR |= RCC_APB2Periph;
    } else {
        RCC->APB2ENR &= ~RCC_APB2Periph;
    }
}

/**
 * @brief  Enables or disables the Low Speed APB (APB1) peripheral clock.
 * @note   After reset, the peripheral clock (used for registers read/write access)
 *         is disabled and the application software has to enable this clock before
 *         using it.
 * @param  RCC_APB1Periph: specifies the APB1 peripheral to gates its clock.
 *         This parameter can be any combination of the following values:
 *           @arg RCC_APB1Periph_TIM2:      TIM2 clock
 *           @arg RCC_APB1Periph_TIM3:      TIM3 clock
 *           @arg RCC_APB1Periph_TIM6:      TIM6 clock
 *           @arg RCC_APB1Periph_TIM14:     TIM14 clock
 *           @arg RCC_APB1Periph_WWDG:      WWDG clock
 *           @arg RCC_APB1Periph_SPI2:      SPI2 clock
 *           @arg RCC_APB1Periph_USART2:    USART2 clock
 *           @arg RCC_APB1Periph_I2C1:      I2C1 clock
 *           @arg RCC_APB1Periph_I2C2:      I2C2 clock
 *           @arg RCC_APB1Periph_PWR:       PWR clock
 *           @arg RCC_APB1Periph_DAC:       DAC clock
 *           @arg RCC_APB1Periph_CEC:       CEC clock
 * @param  NewState: new state of the specified peripheral clock.
 *         This parameter can be: ENABLE or DISABLE.
 * @retval None
 */
void RCC_APB1PeriphClockCmd(uint32_t RCC_APB1Periph, FunctionalState NewState) {
    if (NewState != DISABLE) {
        RCC->APB1ENR |= RCC_APB1Periph;
    } else {
        RCC->APB1ENR &= ~RCC_APB1Periph;
    }
}

/**
 * @brief  Returns the frequencies of the System, AHB and APB busses clocks.
 * @note    The frequency returned by this function is not the real frequency
 *           in the chip. It is calculated based on the predefined constant and
 *           the source selected by RCC_SYSCLKConfig():
 *
 * @note     If SYSCLK source is HSI, function returns constant HSI_VALUE(*)
 *
 * @note     If SYSCLK source is HSE, function returns constant HSE_VALUE(**)
 *
 * @note     If SYSCLK source is PLL, function returns constant HSE_VALUE(**)
 *             or HSI_VALUE(*) multiplied by the PLL factors.
 *
 *         (*) HSI_VALUE is a constant defined in stm32f0xx.h file (default value
 *             8 MHz) but the real value may vary depending on the variations
 *             in voltage and temperature, refer to RCC_AdjustHSICalibrationValue().
 *
 *         (**) HSE_VALUE is a constant defined in stm32f0xx.h file (default value
 *              8 MHz), user has to ensure that HSE_VALUE is same as the real
 *              frequency of the crystal used. Otherwise, this function may
 *              return wrong result.
 *
 *         - The result of this function could be not correct when using fractional
 *           value for HSE crystal.
 *
 * @param  RCC_Clocks: pointer to a RCC_ClocksTypeDef structure which will hold
 *         the clocks frequencies.
 *
 * @note     This function can be used by the user application to compute the
 *           baudrate for the communication peripherals or configure other parameters.
 * @note     Each time SYSCLK, HCLK and/or PCLK clock changes, this function
 *           must be called to update the structure's field. Otherwise, any
 *           configuration based on this function will be incorrect.
 *
 * @retval None
 */
void RCC_GetClocksFreq(RCC_ClocksTypeDef* RCC_Clocks) {
    uint32_t tmp = 0, pllmull = 0, pllsource = 0, prediv1factor = 0, presc = 0;

    /* Get SYSCLK source -------------------------------------------------------*/
    tmp = RCC->CFGR & RCC_CFGR_SWS;

    switch (tmp) {
        case 0x00: /* HSI used as system clock */
            RCC_Clocks->SYSCLK_Frequency = HSI_VALUE;
            break;
        case 0x04: /* HSE used as system clock */
            RCC_Clocks->SYSCLK_Frequency = HSE_VALUE;
            break;
        case 0x08: /* PLL used as system clock */
            /* Get PLL clock source and multiplication factor ----------------------*/
            pllmull   = RCC->CFGR & RCC_CFGR_PLLMULL;
            pllsource = RCC->CFGR & RCC_CFGR_PLLSRC;
            pllmull   = (pllmull >> 18) + 2;

            if (pllsource == 0x00) {
                /* HSI oscillator clock divided by 2 selected as PLL clock entry */
                RCC_Clocks->SYSCLK_Frequency = (HSI_VALUE >> 1) * pllmull;
            } else {
                prediv1factor = (RCC->CFGR2 & RCC_CFGR2_PREDIV1) + 1;
                /* HSE oscillator clock selected as PREDIV1 clock entry */
                RCC_Clocks->SYSCLK_Frequency = (HSE_VALUE / prediv1factor) * pllmull;
            }
            break;
        default: /* HSI used as system clock */
            RCC_Clocks->SYSCLK_Frequency = HSI_VALUE;
            break;
    }
    /* Compute HCLK, PCLK clocks frequencies -----------------------------------*/
    /* Get HCLK prescaler */
    tmp   = RCC->CFGR & RCC_CFGR_HPRE;
    tmp   = tmp >> 4;
    presc = APBAHBPrescTable[tmp];
    /* HCLK clock frequency */
    RCC_Clocks->HCLK_Frequency = RCC_Clocks->SYSCLK_Frequency >> presc;

    /* Get PCLK prescaler */
    tmp   = RCC->CFGR & RCC_CFGR_PPRE;
    tmp   = tmp >> 8;
    presc = APBAHBPrescTable[tmp];
    /* PCLK clock frequency */
    RCC_Clocks->PCLK_Frequency = RCC_Clocks->HCLK_Frequency >> presc;

    /* ADCCLK clock frequency */
    if ((RCC->CFGR3 & RCC_CFGR3_ADCSW) != RCC_CFGR3_ADCSW) {
        /* ADC Clock is HSI14 Osc. */
        RCC_Clocks->ADCCLK_Frequency = HSI14_VALUE;
    } else {
        if ((RCC->CFGR & RCC_CFGR_ADCPRE) != RCC_CFGR_ADCPRE) {
            /* ADC Clock is derived from PCLK/2 */
            RCC_Clocks->ADCCLK_Frequency = RCC_Clocks->PCLK_Frequency >> 1;
        } else {
            /* ADC Clock is derived from PCLK/4 */
            RCC_Clocks->ADCCLK_Frequency = RCC_Clocks->PCLK_Frequency >> 2;
        }
    }

    /* CECCLK clock frequency */
    if ((RCC->CFGR3 & RCC_CFGR3_CECSW) != RCC_CFGR3_CECSW) {
        /* CEC Clock is HSI/256 */
        RCC_Clocks->CECCLK_Frequency = HSI_VALUE / 244;
    } else {
        /* CECC Clock is LSE Osc. */
        RCC_Clocks->CECCLK_Frequency = LSE_VALUE;
    }

