qmk/qmk_firmware/keyboards/nuphy/halo96v2/ansi/mcu_stm32f0xx.h
    /* I2C1CLK clock frequency */
    if ((RCC->CFGR3 & RCC_CFGR3_I2C1SW) != RCC_CFGR3_I2C1SW) {
        /* I2C1 Clock is HSI Osc. */
        RCC_Clocks->I2C1CLK_Frequency = HSI_VALUE;
    } else {
        /* I2C1 Clock is System Clock */
        RCC_Clocks->I2C1CLK_Frequency = RCC_Clocks->SYSCLK_Frequency;
    }

    /* USART1CLK clock frequency */
    if ((RCC->CFGR3 & RCC_CFGR3_USART1SW) == 0x0) {
        /* USART1 Clock is PCLK */
        RCC_Clocks->USART1CLK_Frequency = RCC_Clocks->PCLK_Frequency;
    } else if ((RCC->CFGR3 & RCC_CFGR3_USART1SW) == RCC_CFGR3_USART1SW_0) {
        /* USART1 Clock is System Clock */
        RCC_Clocks->USART1CLK_Frequency = RCC_Clocks->SYSCLK_Frequency;
    } else if ((RCC->CFGR3 & RCC_CFGR3_USART1SW) == RCC_CFGR3_USART1SW_1) {
        /* USART1 Clock is LSE Osc. */
        RCC_Clocks->USART1CLK_Frequency = LSE_VALUE;
    } else if ((RCC->CFGR3 & RCC_CFGR3_USART1SW) == RCC_CFGR3_USART1SW) {
        /* USART1 Clock is HSI Osc. */
        RCC_Clocks->USART1CLK_Frequency = HSI_VALUE;
    }
}

#define CR_DS_MASK ((uint32_t)0xFFFFFFFC)
#define CR_PLS_MASK ((uint32_t)0xFFFFFF1F)
/**
 * @brief  Enters STOP mode.
 * @note   In Stop mode, all I/O pins keep the same state as in Run mode.
 * @note   When exiting Stop mode by issuing an interrupt or a wakeup event,
 *         the HSI RC oscillator is selected as system clock.
 * @note   When the voltage regulator operates in low power mode, an additional
 *         startup delay is incurred when waking up from Stop mode.
 *         By keeping the internal regulator ON during Stop mode, the consumption
 *         is higher although the startup time is reduced.
 * @param  PWR_Regulator: specifies the regulator state in STOP mode.
 *         This parameter can be one of the following values:
 *             @arg PWR_Regulator_ON: STOP mode with regulator ON
 *             @arg PWR_Regulator_LowPower: STOP mode with regulator in low power mode
 * @param  PWR_STOPEntry: specifies if STOP mode in entered with WFI or WFE instruction.
 *         This parameter can be one of the following values:
 *             @arg PWR_STOPEntry_WFI: enter STOP mode with WFI instruction
 *             @arg PWR_STOPEntry_WFE: enter STOP mode with WFE instruction
 * @retval None
 */
void PWR_EnterSTOPMode(uint32_t PWR_Regulator, uint8_t PWR_STOPEntry) {
    uint32_t tmpreg = 0;

    /* Check the parameters */

    /* Select the regulator state in STOP mode ---------------------------------*/
    tmpreg = PWR->CR;
    /* Clear PDDS and LPDSR bits */
    tmpreg &= CR_DS_MASK;

    /* Set LPDSR bit according to PWR_Regulator value */
    tmpreg |= PWR_Regulator;

    /* Store the new value */
    PWR->CR = tmpreg;

    /* Set SLEEPDEEP bit of Cortex-M0 System Control Register */
    SCB->SCR |= SCB_SCR_SLEEPDEEP_Msk;

    /* Select STOP mode entry --------------------------------------------------*/
    if (PWR_STOPEntry == PWR_STOPEntry_WFI) {
        /* Request Wait For Interrupt */
        __WFI();
    } else {
        /* Request Wait For Event */
        __WFE();
    }
    /* Reset SLEEPDEEP bit of Cortex System Control Register */
    SCB->SCR &= (uint32_t) ~((uint32_t)SCB_SCR_SLEEPDEEP_Msk);
}

/**
 * @brief  Enters Sleep mode.
 * @note   In Sleep mode, all I/O pins keep the same state as in Run mode.
 * @param  PWR_SLEEPEntry: specifies if SLEEP mode in entered with WFI or WFE instruction.
 *         This parameter can be one of the following values:
 *             @arg PWR_SLEEPEntry_WFI: enter SLEEP mode with WFI instruction
 *             @arg PWR_SLEEPEntry_WFE: enter SLEEP mode with WFE instruction
 * @retval None
 */
void PWR_EnterSleepMode(uint8_t PWR_SLEEPEntry) {
    /* Clear SLEEPDEEP bit of Cortex-M0 System Control Register */
    SCB->SCR &= (uint32_t) ~((uint32_t)SCB_SCR_SLEEPDEEP_Msk);

    /* Select SLEEP mode entry -------------------------------------------------*/
    if (PWR_SLEEPEntry == PWR_SLEEPEntry_WFI) {
        /* Request Wait For Interrupt */
        __WFI();
    } else {
        /* Request Wait For Event */
        __WFE();
    }
}

//////////////////////////////////////////////////////////////////////////////
// GPIO

/** @defgroup Configuration_Mode_enumeration
 * @{
 */
typedef enum {
    GPIO_Mode_IN  = 0x00, /*!< GPIO Input Mode              */
    GPIO_Mode_OUT = 0x01, /*!< GPIO Output Mode             */
    GPIO_Mode_AF  = 0x02, /*!< GPIO Alternate function Mode */
    GPIO_Mode_AN  = 0x03  /*!< GPIO Analog In/Out Mode      */
} GPIOMode_TypeDef;

#define IS_GPIO_MODE(MODE) (((MODE) == GPIO_Mode_IN) || ((MODE) == GPIO_Mode_OUT) || ((MODE) == GPIO_Mode_AF) || ((MODE) == GPIO_Mode_AN))
/**
 * @}
 */

/** @defgroup Output_type_enumeration
 * @{
 */
typedef enum { GPIO_OType_PP = 0x00, GPIO_OType_OD = 0x01 } GPIOOType_TypeDef;

#define IS_GPIO_OTYPE(OTYPE) (((OTYPE) == GPIO_OType_PP) || ((OTYPE) == GPIO_OType_OD))

/**
 * @}
 */

/** @defgroup Output_Maximum_frequency_enumeration
 * @{
 */
typedef enum {
    GPIO_Speed_Level_1 = 0x01, /*!< Medium Speed */
    GPIO_Speed_Level_2 = 0x02, /*!< Fast Speed   */
    GPIO_Speed_Level_3 = 0x03  /*!< High Speed   */
} GPIOSpeed_TypeDef;

#define IS_GPIO_SPEED(SPEED) (((SPEED) == GPIO_Speed_Level_1) || ((SPEED) == GPIO_Speed_Level_2) || ((SPEED) == GPIO_Speed_Level_3))
/**
 * @}
 */

/** @defgroup Configuration_Pull-Up_Pull-Down_enumeration
 * @{
 */
typedef enum { GPIO_PuPd_NOPULL = 0x00, GPIO_PuPd_UP = 0x01, GPIO_PuPd_DOWN = 0x02 } GPIOPuPd_TypeDef;

#define IS_GPIO_PUPD(PUPD) (((PUPD) == GPIO_PuPd_NOPULL) || ((PUPD) == GPIO_PuPd_UP) || ((PUPD) == GPIO_PuPd_DOWN))
/**
 * @}
 */

/** @defgroup Bit_SET_and_Bit_RESET_enumeration
 * @{
 */
typedef enum { Bit_RESET = 0, Bit_SET } BitAction;

/**
 * @brief  GPIO Init structure definition
 */
typedef struct {
    uint32_t GPIO_Pin; /*!< Specifies the GPIO pins to be configured.
                            This parameter can be any value of @ref GPIO_pins_define */

    GPIOMode_TypeDef GPIO_Mode; /*!< Specifies the operating mode for the selected pins.
                                     This parameter can be a value of @ref GPIOMode_TypeDef   */

    GPIOSpeed_TypeDef GPIO_Speed; /*!< Specifies the speed for the selected pins.
                                       This parameter can be a value of @ref GPIOSpeed_TypeDef  */

    GPIOOType_TypeDef GPIO_OType; /*!< Specifies the operating output type for the selected pins.
                                       This parameter can be a value of @ref GPIOOType_TypeDef  */

    GPIOPuPd_TypeDef GPIO_PuPd; /*!< Specifies the operating Pull-up/Pull down for the selected pins.
                                     This parameter can be a value of @ref GPIOPuPd_TypeDef   */
} GPIO_InitTypeDef;

/* Exported constants --------------------------------------------------------*/

/** @defgroup GPIO_Exported_Constants
 * @{
 */

/** @defgroup GPIO_pins_define
 * @{
 */
#define GPIO_Pin_0 ((uint16_t)0x0001)   /*!< Pin 0 selected    */
#define GPIO_Pin_1 ((uint16_t)0x0002)   /*!< Pin 1 selected    */
#define GPIO_Pin_2 ((uint16_t)0x0004)   /*!< Pin 2 selected    */
#define GPIO_Pin_3 ((uint16_t)0x0008)   /*!< Pin 3 selected    */
#define GPIO_Pin_4 ((uint16_t)0x0010)   /*!< Pin 4 selected    */
#define GPIO_Pin_5 ((uint16_t)0x0020)   /*!< Pin 5 selected    */
#define GPIO_Pin_6 ((uint16_t)0x0040)   /*!< Pin 6 selected    */
#define GPIO_Pin_7 ((uint16_t)0x0080)   /*!< Pin 7 selected    */
#define GPIO_Pin_8 ((uint16_t)0x0100)   /*!< Pin 8 selected    */
#define GPIO_Pin_9 ((uint16_t)0x0200)   /*!< Pin 9 selected    */
#define GPIO_Pin_10 ((uint16_t)0x0400)  /*!< Pin 10 selected   */
#define GPIO_Pin_11 ((uint16_t)0x0800)  /*!< Pin 11 selected   */
#define GPIO_Pin_12 ((uint16_t)0x1000)  /*!< Pin 12 selected   */
#define GPIO_Pin_13 ((uint16_t)0x2000)  /*!< Pin 13 selected   */
#define GPIO_Pin_14 ((uint16_t)0x4000)  /*!< Pin 14 selected   */
#define GPIO_Pin_15 ((uint16_t)0x8000)  /*!< Pin 15 selected   */
#define GPIO_Pin_All ((uint16_t)0xFFFF) /*!< All pins selected */

