qmk/qmk_firmware/keyboards/nuphy/halo96v2/ansi/mcu_stm32f0xx.h
    if (USARTx == USART1) {
        apbclock = RCC_ClocksStatus.USART1CLK_Frequency;
    } else {
        apbclock = RCC_ClocksStatus.PCLK_Frequency;
    }
    /* Determine the integer part */
    if ((USARTx->CR1 & USART_CR1_OVER8) != 0) {
        /* Integer part computing in case Oversampling mode is 8 Samples */
        integerdivider = ((25 * apbclock) / (2 * (USART_InitStruct->USART_BaudRate)));
    } else /* if ((USARTx->CR1 & CR1_OVER8_Set) == 0) */
    {
        /* Integer part computing in case Oversampling mode is 16 Samples */
        integerdivider = ((25 * apbclock) / (4 * (USART_InitStruct->USART_BaudRate)));
    }
    tmpreg = (integerdivider / 100) << 4;

    /* Determine the fractional part */
    fractionaldivider = integerdivider - (100 * (tmpreg >> 4));

    /* Implement the fractional part in the register */
    if ((USARTx->CR1 & USART_CR1_OVER8) != 0) {
        tmpreg |= ((((fractionaldivider * 8) + 50) / 100)) & ((uint8_t)0x07);
    } else /* if ((USARTx->CR1 & CR1_OVER8_Set) == 0) */
    {
        tmpreg |= ((((fractionaldivider * 16) + 50) / 100)) & ((uint8_t)0x0F);
    }

    /* Write to USART BRR */
    USARTx->BRR = (uint16_t)tmpreg;
}

/**
 * @brief  Enables or disables the specified USART peripheral.
 * @param  USARTx: where x can be 1 or 2 to select the USART peripheral.
 * @param  NewState: new state of the USARTx peripheral.
 *   This parameter can be: ENABLE or DISABLE.
 * @retval None
 */
void USART_Cmd(USART_TypeDef* USARTx, FunctionalState NewState) {
    if (NewState != DISABLE) {
        /* Enable the selected USART by setting the UE bit in the CR1 register */
        USARTx->CR1 |= USART_CR1_UE;
    } else {
        /* Disable the selected USART by clearing the UE bit in the CR1 register */
        USARTx->CR1 &= (uint32_t) ~((uint32_t)USART_CR1_UE);
    }
}

/**
 * @brief  Checks whether the specified USART flag is set or not.
 * @param  USARTx: where x can be 1 or 2 to select the USART peripheral.
 * @param  USART_FLAG: specifies the flag to check.
 *   This parameter can be one of the following values:
 *     @arg USART_FLAG_REACK:  Receive Enable acknowledge flag.
 *     @arg USART_FLAG_TEACK:  Transmit Enable acknowledge flag.
 *     @arg USART_FLAG_WUF:  Wake up flag.
 *     @arg USART_FLAG_RWU:  Receive Wake up flag.
 *     @arg USART_FLAG_SBK:  Send Break flag.
 *     @arg USART_FLAG_CMF:  Character match flag.
 *     @arg USART_FLAG_BUSY:  Busy flag.
 *     @arg USART_FLAG_ABRF:  Auto baud rate flag.
 *     @arg USART_FLAG_ABRE:  Auto baud rate error flag.
 *     @arg USART_FLAG_EOBF:  End of block flag.
 *     @arg USART_FLAG_RTOF:  Receive time out flag.
 *     @arg USART_FLAG_nCTSS:  Inverted nCTS input bit status.
 *     @arg USART_FLAG_CTS:  CTS Change flag.
 *     @arg USART_FLAG_LBD:  LIN Break detection flag.
 *     @arg USART_FLAG_TXE:  Transmit data register empty flag.
 *     @arg USART_FLAG_TC:  Transmission Complete flag.
 *     @arg USART_FLAG_RXNE:  Receive data register not empty flag.
 *     @arg USART_FLAG_IDLE:  Idle Line detection flag.
 *     @arg USART_FLAG_ORE:  OverRun Error flag.
 *     @arg USART_FLAG_NE:  Noise Error flag.
 *     @arg USART_FLAG_FE:  Framing Error flag.
 *     @arg USART_FLAG_PE:  Parity Error flag.
 * @retval The new state of USART_FLAG (SET or RESET).
 */
ST_FlagStatus USART_GetFlagStatus(USART_TypeDef* USARTx, uint32_t USART_FLAG) {
    ST_FlagStatus bitstatus = ST_RESET;

    if ((USARTx->ISR & USART_FLAG) != (uint16_t)ST_RESET) {
        bitstatus = ST_SET;
    } else {
        bitstatus = ST_RESET;
    }
    return bitstatus;
}

/**
 * @brief  Clears the USARTx's pending flags.
 * @param  USARTx: where x can be 1 or 2 to select the USART peripheral.
 * @param  USART_FLAG: specifies the flag to clear.
 *   This parameter can be any combination of the following values:
 *     @arg USART_FLAG_WUF:  Wake up flag.
 *     @arg USART_FLAG_CMF:  Character match flag.
 *     @arg USART_FLAG_EOBF:  End of block flag.
 *     @arg USART_FLAG_RTOF:  Receive time out flag.
 *     @arg USART_FLAG_CTS:  CTS Change flag.
 *     @arg USART_FLAG_LBD:  LIN Break detection flag.
 *     @arg USART_FLAG_TC:  Transmission Complete flag.
 *     @arg USART_FLAG_IDLE:  IDLE line detected flag.
 *     @arg USART_FLAG_ORE:  OverRun Error flag.
 *     @arg USART_FLAG_NE: Noise Error flag.
 *     @arg USART_FLAG_FE: Framing Error flag.
 *     @arg USART_FLAG_PE:   Parity Errorflag.
 *
 * @note     RXNE pending bit is cleared by a read to the USART_RDR register
 *           (USART_ReceiveData()) or by writing 1 to the RXFRQ in the register
 *           USART_RQR (USART_RequestCmd()).
 * @note     TC flag can be also cleared by software sequence: a read operation
 *           to USART_SR register (USART_GetFlagStatus()) followed by a write
 *           operation to USART_TDR register (USART_SendData()).
 * @note     TXE flag is cleared by a write to the USART_TDR register (USART_SendData())
 *           or by writing 1 to the TXFRQ in the register USART_RQR (USART_RequestCmd()).
 * @note     SBKF flag is cleared by 1 to the SBKRQ in the register USART_RQR
 *           (USART_RequestCmd()).
 * @retval None
 */
void USART_ClearFlag(USART_TypeDef* USARTx, uint32_t USART_FLAG) {
    USARTx->ICR = USART_FLAG;
}

/**
 * @brief  Enables or disables the specified USART interrupts.
 * @param  USARTx: where x can be 1 or 2 to select the USART peripheral.
 * @param  USART_IT: specifies the USART interrupt sources to be enabled or disabled.
 *   This parameter can be one of the following values:
 *     @arg USART_IT_WU:  Wake up interrupt.
 *     @arg USART_IT_CM:  Character match interrupt.
 *     @arg USART_IT_EOB:  End of block interrupt.
 *     @arg USART_IT_RTO:  Receive time out interrupt.
 *     @arg USART_IT_CTS:  CTS change interrupt.
 *     @arg USART_IT_LBD:  LIN Break detection interrupt.
 *     @arg USART_IT_TXE:  Tansmit Data Register empty interrupt.
 *     @arg USART_IT_TC:  Transmission complete interrupt.
 *     @arg USART_IT_RXNE:  Receive Data register not empty interrupt.
 *     @arg USART_IT_IDLE:  Idle line detection interrupt.
 *     @arg USART_IT_PE:  Parity Error interrupt.
 *     @arg USART_IT_ERR:  Error interrupt(Frame error, noise error, overrun error)
 * @param  NewState: new state of the specified USARTx interrupts.
 *   This parameter can be: ENABLE or DISABLE.
 * @retval None
 */
void USART_ITConfig(USART_TypeDef* USARTx, uint32_t USART_IT, FunctionalState NewState) {
    uint32_t usartreg = 0, itpos = 0, itmask = 0;
    uint32_t usartxbase = 0;

    usartxbase = (uint32_t)USARTx;

    /* Get the USART register index */
    usartreg = (((uint16_t)USART_IT) >> 0x08);

    /* Get the interrupt position */
    itpos  = USART_IT & IT_MASK;
    itmask = (((uint32_t)0x01) << itpos);

    if (usartreg == 0x02) /* The IT is in CR2 register */
    {
        usartxbase += 0x04;
    } else if (usartreg == 0x03) /* The IT is in CR3 register */
    {
        usartxbase += 0x08;
    } else /* The IT is in CR1 register */
    {
    }
    if (NewState != DISABLE) {
        *(__IO uint32_t*)usartxbase |= itmask;
    } else {
        *(__IO uint32_t*)usartxbase &= ~itmask;
    }
}

/**
 * @brief  Returns the most recent received data by the USARTx peripheral.
 * @param  USARTx: where x can be 1 or 2 to select the USART peripheral.
 * @retval The received data.
 */
uint16_t USART_ReceiveData(USART_TypeDef* USARTx) {
    /* Receive Data */
    return (uint16_t)(USARTx->RDR & (uint16_t)0x01FF);
}

//////////////////////////////////////////////////////////////////////////////
// NVIC

