qmk/qmk_firmware/keyboards/nuphy/halo96v2/ansi/mcu_stm32f0xx.h
    /* Set the Prescaler value */
    TIMx->PSC = TIM_TimeBaseInitStruct->TIM_Prescaler;

    if ((TIMx == TIM1) || (TIMx == TIM15) || (TIMx == TIM16) || (TIMx == TIM17)) {
        /* Set the Repetition Counter value */
        TIMx->RCR = TIM_TimeBaseInitStruct->TIM_RepetitionCounter;
    }

    /* Generate an update event to reload the Prescaler and the Repetition counter
       values immediately */
    TIMx->EGR = TIM_PSCReloadMode_Immediate;
}

/**
 * @brief  Enables or disables the specified TIM interrupts.
 * @param  TIMx: where x can be 1, 2, 3, 6, 14, 15, 16 or 17 to select the TIMx peripheral.
 * @param  TIM_IT: specifies the TIM interrupts sources to be enabled or disabled.
 *   This parameter can be any combination of the following values:
 *     @arg TIM_IT_Update: TIM update Interrupt source
 *     @arg TIM_IT_CC1: TIM Capture Compare 1 Interrupt source
 *     @arg TIM_IT_CC2: TIM Capture Compare 2 Interrupt source
 *     @arg TIM_IT_CC3: TIM Capture Compare 3 Interrupt source
 *     @arg TIM_IT_CC4: TIM Capture Compare 4 Interrupt source
 *     @arg TIM_IT_COM: TIM Commutation Interrupt source
 *     @arg TIM_IT_Trigger: TIM Trigger Interrupt source
 *     @arg TIM_IT_Break: TIM Break Interrupt source
 * @note
 *   - TIM6 can only generate an update interrupt.
 *   - TIM15 can have only TIM_IT_Update, TIM_IT_CC1,
 *     TIM_IT_CC2 or TIM_IT_Trigger.
 *   - TIM14, TIM16 and TIM17 can have TIM_IT_Update or TIM_IT_CC1.
 *   - TIM_IT_Break is used only with TIM1 and TIM15.
 *   - TIM_IT_COM is used only with TIM1, TIM15, TIM16 and TIM17.
 * @param  NewState: new state of the TIM interrupts.
 *   This parameter can be: ENABLE or DISABLE.
 * @retval None
 */
void TIM_ITConfig(TIM_TypeDef* TIMx, uint16_t TIM_IT, FunctionalState NewState) {
    if (NewState != DISABLE) {
        /* Enable the Interrupt sources */
        TIMx->DIER |= TIM_IT;
    } else {
        /* Disable the Interrupt sources */
        TIMx->DIER &= (uint16_t)~TIM_IT;
    }
}

/**
 * @brief  Checks whether the specified TIM flag is set or not.
 * @param  TIMx: where x can be 1, 2, 3, 6, 14, 15, 16 or 17 to select the TIM peripheral.
 * @param  TIM_FLAG: specifies the flag to check.
 *   This parameter can be one of the following values:
 *     @arg TIM_FLAG_Update: TIM update Flag
 *     @arg TIM_FLAG_CC1: TIM Capture Compare 1 Flag
 *     @arg TIM_FLAG_CC2: TIM Capture Compare 2 Flag
 *     @arg TIM_FLAG_CC3: TIM Capture Compare 3 Flag
 *     @arg TIM_FLAG_CC4: TIM Capture Compare 4 Flag
 *     @arg TIM_FLAG_COM: TIM Commutation Flag
 *     @arg TIM_FLAG_Trigger: TIM Trigger Flag
 *     @arg TIM_FLAG_Break: TIM Break Flag
 *     @arg TIM_FLAG_CC1OF: TIM Capture Compare 1 overcapture Flag
 *     @arg TIM_FLAG_CC2OF: TIM Capture Compare 2 overcapture Flag
 *     @arg TIM_FLAG_CC3OF: TIM Capture Compare 3 overcapture Flag
 *     @arg TIM_FLAG_CC4OF: TIM Capture Compare 4 overcapture Flag
 * @note
 *   - TIM6 can have only one update flag.
 *   - TIM15 can have only TIM_FLAG_Update, TIM_FLAG_CC1, TIM_FLAG_CC2 or
 *     TIM_FLAG_Trigger.
 *   - TIM14, TIM16 and TIM17 can have TIM_FLAG_Update or TIM_FLAG_CC1.
 *   - TIM_FLAG_Break is used only with TIM1 and TIM15.
 *   - TIM_FLAG_COM is used only with TIM1 TIM15, TIM16 and TIM17.
 * @retval The new state of TIM_FLAG (SET or RESET).
 */
ST_FlagStatus TIM_GetFlagStatus(TIM_TypeDef* TIMx, uint16_t TIM_FLAG) {
    ST_FlagStatus bitstatus = ST_RESET;

    if ((TIMx->SR & TIM_FLAG) != (uint16_t)ST_RESET) {
        bitstatus = ST_SET;
    } else {
        bitstatus = ST_RESET;
    }
    return bitstatus;
}

/**
 * @brief  Clears the TIMx's pending flags.
 * @param  TIMx: where x can be 1, 2, 3, 6, 14, 15, 16 or 17 to select the TIM peripheral.
 * @param  TIM_FLAG: specifies the flag bit to clear.
 *   This parameter can be any combination of the following values:
 *     @arg TIM_FLAG_Update: TIM update Flag
 *     @arg TIM_FLAG_CC1: TIM Capture Compare 1 Flag
 *     @arg TIM_FLAG_CC2: TIM Capture Compare 2 Flag
 *     @arg TIM_FLAG_CC3: TIM Capture Compare 3 Flag
 *     @arg TIM_FLAG_CC4: TIM Capture Compare 4 Flag
 *     @arg TIM_FLAG_COM: TIM Commutation Flag
 *     @arg TIM_FLAG_Trigger: TIM Trigger Flag
 *     @arg TIM_FLAG_Break: TIM Break Flag
 *     @arg TIM_FLAG_CC1OF: TIM Capture Compare 1 overcapture Flag
 *     @arg TIM_FLAG_CC2OF: TIM Capture Compare 2 overcapture Flag
 *     @arg TIM_FLAG_CC3OF: TIM Capture Compare 3 overcapture Flag
 *     @arg TIM_FLAG_CC4OF: TIM Capture Compare 4 overcapture Flag
 * @note
 *   - TIM6 can have only one update flag.
 *   - TIM15 can have only TIM_FLAG_Update, TIM_FLAG_CC1,TIM_FLAG_CC2 or
 *     TIM_FLAG_Trigger.
 *   - TIM14, TIM16 and TIM17 can have TIM_FLAG_Update or TIM_FLAG_CC1.
 *   - TIM_FLAG_Break is used only with TIM1 and TIM15.
 *   - TIM_FLAG_COM is used only with TIM1, TIM15, TIM16 and TIM17.
 * @retval None
 */
void TIM_ClearFlag(TIM_TypeDef* TIMx, uint16_t TIM_FLAG) {
    /* Clear the flags */
    TIMx->SR = (uint16_t)~TIM_FLAG;
}

/**
 * @brief  Enables or disables the specified TIM peripheral.
 * @param  TIMx: where x can be 1, 2, 3, 6, 14, 15, 16 and 17to select the TIMx
 *         peripheral.
 * @param  NewState: new state of the TIMx peripheral.
 *         This parameter can be: ENABLE or DISABLE.
 * @retval None
 */
void TIM_Cmd(TIM_TypeDef* TIMx, FunctionalState NewState) {
    if (NewState != DISABLE) {
        /* Enable the TIM Counter */
        TIMx->CR1 |= TIM_CR1_CEN;
    } else {
        /* Disable the TIM Counter */
        TIMx->CR1 &= (uint16_t)(~((uint16_t)TIM_CR1_CEN));
    }
}
